In [26]:
import pandas as pd
import numpy as np
from pymove import MoveDataFrame

In [27]:
from pymove import filters

In [28]:
from pymove import transformations

In [29]:
df = pd.read_csv('examples/geolife_sample.csv', parse_dates=['datetime'])
df.head()

         lat         lon            datetime  id
0  39.984094  116.319236 2008-10-23 05:53:05   1
1  39.984198  116.319322 2008-10-23 05:53:06   1
2  39.984224  116.319402 2008-10-23 05:53:11   1
3  39.984211  116.319389 2008-10-23 05:53:16   1
4  39.984217  116.319422 2008-10-23 05:53:21   1

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 217653 entries, 0 to 217652
Data columns (total 4 columns):
lat         217653 non-null float64
lon         217653 non-null float64
datetime    217653 non-null datetime64[ns]
id          217653 non-null int64
dtypes: datetime64[ns](1), float64(2), int64(1)
memory usage: 6.6 MB

In [31]:
df_move = MoveDataFrame(df, latitude="lat", longitude="lon", datetime="datetime")

In [32]:
bbox = (22.147577, 113.54884299999999, 41.132062, 121.156224)
bbox

(22.147577, 113.54884299999999, 41.132062, 121.156224)

In [33]:
filters.by_bbox(df_move, bbox, filter_out = True)

Empty DataFrame
Columns: [lat, lon, datetime, id]
Index: []

In [34]:
filters.by_datetime(df_move,"2009-03-19 05:45:37", "2009-03-19 05:46:17")

              lat         lon            datetime  id
217644  40.000128  116.327171 2009-03-19 05:45:42   5
217645  40.000069  116.327179 2009-03-19 05:45:47   5
217646  40.000001  116.327219 2009-03-19 05:45:52   5
217647  39.999919  116.327211 2009-03-19 05:45:57   5
217648  39.999896  116.327290 2009-03-19 05:46:02   5
217649  39.999899  116.327352 2009-03-19 05:46:07   5
217650  39.999945  116.327394 2009-03-19 05:46:12   5
217651  40.000015  116.327433 2009-03-19 05:46:17   5

In [35]:
filters.by_label(df_move, 116.327219, "lon").head()

             lat         lon            datetime  id
3066   39.979160  116.327219 2008-10-24 06:34:27   1
13911  39.975424  116.327219 2008-10-26 08:18:06   1
16396  39.980411  116.327219 2008-10-27 00:30:47   1
33935  39.975832  116.327219 2008-11-05 11:04:04   1
41636  39.976990  116.327219 2008-11-07 10:34:41   1

In [36]:
teste = filters.by_label(df_move, "2008-10-24 04:12:30" , "datetime")
type(teste)

pandas.core.frame.DataFrame

In [37]:
filters.by_label(df_move, "2008-10-24 04:12:30" , "datetime", filter_out=True).head()

         lat         lon            datetime  id
0  39.984094  116.319236 2008-10-23 05:53:05   1
1  39.984198  116.319322 2008-10-23 05:53:06   1
2  39.984224  116.319402 2008-10-23 05:53:11   1
3  39.984211  116.319389 2008-10-23 05:53:16   1
4  39.984217  116.319422 2008-10-23 05:53:21   1

In [38]:
filters.by_id(df_move, 5).head()

              lat         lon            datetime  id
108607  40.004155  116.321337 2008-10-24 04:12:30   5
108608  40.003834  116.321462 2008-10-24 04:12:35   5
108609  40.003783  116.321431 2008-10-24 04:12:40   5
108610  40.003690  116.321429 2008-10-24 04:12:45   5
108611  40.003589  116.321427 2008-10-24 04:12:50   5

In [39]:
df_move.generate_tid_based_on_id_datatime()
filters.by_tid(df_move, "12008102305").head()

Creating or updating tid feature...

...Sorting by id and datetime to increase performance


...tid feature was created...

         lat         lon            datetime  id          tid
0  39.984094  116.319236 2008-10-23 05:53:05   1  12008102305
1  39.984198  116.319322 2008-10-23 05:53:06   1  12008102305
2  39.984224  116.319402 2008-10-23 05:53:11   1  12008102305
3  39.984211  116.319389 2008-10-23 05:53:16   1  12008102305
4  39.984217  116.319422 2008-10-23 05:53:21   1  12008102305

In [40]:
filters.outliers(df_move).head()

Creating or updating distance features in meters...

...Sorting by id and datetime to increase performance

...Set id as index to increase attribution performance

(217653/217653) 100% in 00:00:00.081 - estimated end in 00:00:00.000
...Reset index

..Total Time: 0.08772921562194824
...Filtring jumps

,id,lat,lon,datetime,tid,dist_to_prev,dist_to_next,dist_prev_to_next
148,1,39.970511,116.341455,2008-10-23 10:32:53,12008102310,1452.319115,1470.641291,71.088460
338,1,39.995042,116.326465,2008-10-23 10:44:24,12008102310,10.801860,10.274331,1.465144
8133,1,39.991075,116.188395,2008-10-25 08:20:19,12008102508,5.090766,6.247860,1.295191
10175,1,40.015169,116.311045,2008-10-25 23:40:12,12008102523,23.454754,24.899678,3.766959
13849,1,39.977157,116.327151,2008-10-26 08:13:53,12008102608,11.212682,10.221164,1.004375

In [41]:
teste = filters.clean_duplicates(df_move)
print(teste)

Remove rows duplicates by subset
...Sorting by id and datetime to increase performance

...There are no GPS points duplicated
None

In [42]:
# #perguntar Nickson
filters.clean_consecutive_duplicates(df_move, subset = ["lat"]).head()

,id,lat,lon,datetime,tid,dist_to_prev,dist_to_next,dist_prev_to_next
0,1,39.984094,116.319236,2008-10-23 05:53:05,12008102305,NaN,13.690153,NaN
1,1,39.984198,116.319322,2008-10-23 05:53:06,12008102305,13.690153,7.403788,20.223428
2,1,39.984224,116.319402,2008-10-23 05:53:11,12008102305,7.403788,1.821083,5.888579
3,1,39.984211,116.319389,2008-10-23 05:53:16,12008102305,1.821083,2.889671,1.873356
4,1,39.984217,116.319422,2008-10-23 05:53:21,12008102305,2.889671,66.555997,68.727260

In [43]:
filters.clean_NaN_values(df_move)

In [44]:
filters.clean_gps_jumps_by_distance(df_move)

Cleaning gps jumps by distance to jump_coefficient 3.0...

...Filtring jumps

...Dropping 383 rows of gps points

...Rows before: 217649, Rows after:217266, Sum drop:383


Cleaning gps jumps by distance to jump_coefficient 3.0...

...Filtring jumps

383 GPS points were dropped

In [45]:
filters.clean_gps_nearby_points_by_distances(df_move)

Cleaning gps points from radius of 10.0 meters

...There are 137478 gps points to drop

...Dropping 137478 gps points

...Rows before: 217266, Rows after:79788


Cleaning gps points from radius of 10.0 meters

...There are 0 gps points to drop

In [46]:
filters.clean_gps_nearby_points_by_speed(df_move)

Creating or updating distance, time and speed features in meters by seconds

...Sorting by id and datetime to increase performance

...Set id as index to a higher peformance

(79788/79788) 100% in 00:00:00.064 - estimated end in 00:00:00.000
...Reset index...

..Total Time: 0.069

Cleaning gps points using 0.0 speed radius

...There are 1 gps points to drop

...Dropping 1 gps points

...Rows before: 79788, Rows after:79787


Cleaning gps points using 0.0 speed radius

...There are 0 gps points to drop

In [47]:
filters.clean_gps_speed_max_radius(df_move)

Clean gps points with speed max > 50.0 meters by seconds
...There 125 gps points with speed_max > 50.0

...Dropping 125 rows of jumps by speed max

...Rows before: 79787, Rows after:79662


Clean gps points with speed max > 50.0 meters by seconds
...There 0 gps points with speed_max > 50.0

In [48]:
filters.clean_trajectories_with_few_points(df_move)

...There are 24 ids with few points

...Tids before drop: 600

...Tids after drop: 576

...Shape - before drop: (79662, 10) - after drop: (79638, 10)

Creating or updating distance, time and speed features in meters by seconds

...Sorting by tid and datetime to increase performance

...Set tid as index to a higher peformance

(78/79638) 0% in 00:00:00.071 - estimated end in 00:01:13.243
(16355/79638) 20% in 00:00:00.091 - estimated end in 00:00:00.355
(32044/79638) 40% in 00:00:00.109 - estimated end in 00:00:00.162
(47785/79638) 60% in 00:00:00.123 - estimated end in 00:00:00.082
(63973/79638) 80% in 00:00:00.147 - estimated end in 00:00:00.036
(79638/79638) 100% in 00:00:00.184 - estimated end in 00:00:00.000
...Reset index...

..Total Time: 0.190

In [50]:
filters.clean_trajectories_short_and_few_points_(df_move)

Remove short trajectories...

...There are 0 ids with few points

...Dropping unnecessary trajectories...

...short trajectories and trajectories with a minimum distance (548): 100

...There are 0 tid do drop